anachrocomputer/PIC32PMP/ili9486test.X/ili9486test.c
    if (is == 0)    /* No saturation so make a grey */
    {
        ir = iv;
        ig = iv;
        ib = iv;
    }
    else
    {
        if (h >= 359.0)
            h = 0.0;

        h /= 60.0;
        i = (int)h;
        f = h - i;

        p = v * (1.0 - s);
        q = v * (1.0 - (s * f));
        t = v * (1.0 - (s * (1.0 - f)));

        switch (i)
        {
        case 0:
            r = v;
            g = t;
            b = p;
            break;
        case 1:
            r = q;
            g = v;
            b = p;
            break;
        case 2:
            r = p;
            g = v;
            b = t;
            break;
        case 3:
            r = p;
            g = q;
            b = v;
            break;
        case 4:
            r = t;
            g = p;
            b = v;
            break;
        case 5:
            r = v;
            g = p;
            b = q;
            break;
        }

        ir = r * MAXPRI;
        ig = g * MAXPRI;
        ib = b * MAXPRI;
    }

    rgb565 = RGB_ILI(ir, ig, ib);

    return (rgb565);
}


/* TRIS_begin --- switch GPIO pins to input or output as required */

static void TRIS_begin(void)
{
    TRISAbits.TRISA7 = 0;   // RA7 pin 92, P3 pin 42 as output (timer toggle)
    TRISAbits.TRISA6 = 0;   // RA6 pin 91, P3 pin 41 as output (LED1)
    TRISBbits.TRISB9 = 0;   // RB9 pin 33, P2 pin 33 as output (LED2)
    
    TRISDbits.TRISD3 = 0;   // RD3 pin 78, P3 pin 28 as output (LCD RESET)
}


void generateGraticule(const struct ColourScheme *cp)
{
    int y;

    for (y = 0; y < GRAT_HT; y++)
    {
        Wgrat[y] = cp->graticule;

        if ((y % GRATICULE) == 0)
            Bgrat[y] = cp->graticule;
        else
            Bgrat[y] = cp->background;

        if ((y % 8) == 0)
            Dgrat[y] = cp->graticule;
        else
            Dgrat[y] = cp->background;

        if ((y == 1) || (y == ((GRAT_HT / 2) + 1)) || (y == ((GRAT_HT / 2) - 1)) || (y == (GRAT_HT - 2)) || ((y % GRATICULE) == 0))
            Tgrat[y] = cp->graticule;
        else
            Tgrat[y] = cp->background;

        if ((y % 2) == 0)
            C1grat[y] = cp->xcursor1;
        else
            C1grat[y] = cp->background;

        if ((y % 2) == 0)
            C2grat[y] = cp->xcursor2;
        else
            C2grat[y] = cp->background;
    }
}


void interpolateY(const uint8_t wave[], const int x, const int yoff, iliColr pixels[], const iliColr colr)
{
    int y1, y2;
    int y;

    y1 = wave[x] + yoff;

    if (x < (GRAT_WD - 1))
        y2 = wave[x + 1] + yoff;
    else
        y2 = y1;

    if ((y1 > 0) && (y1 < GRAT_HT) && (y2 > 0) && (y2 < GRAT_HT))
    {
        if (y2 < y1)
        {
            y = y1;
            y1 = y2;
            y2 = y;
        }

        for (y = y1; y <= y2; y++)
            pixels[y] = colr;
    }
}


void ili9486_renderFont(const int x1, const int y1, const iliColr fg, const iliColr bg, const uint8_t *const str)
{
    const int len = strlen(str);
    const int wd = len * FONT_WD;
    const int ht = FONT_HT;
    const int x2 = x1 + wd - 1;
    const int y2 = y1 + ht - 1;
    int i, row, col;
    uint8_t bits, mask;
    iliColr pixel;
    
    iliCmd4(ILI9486_COL_ADDR, x1 >> 8, x1, x2 >> 8, x2);
    iliCmd4(ILI9486_PAGE_ADDR, y1 >> 8, y1, y2 >> 8, y2);
    
    PMADDRbits.CS1 = 1;     // PMCS1 active
    
    while (PMMODEbits.BUSY)
        ;
    
    PMADDRbits.ADDR = 0;
    PMDIN = ILI9486_MEMORY_WR;
    
    while (PMMODEbits.BUSY)
        ;
    
    PMADDRbits.ADDR = 1;
    
    for (row = 0; row < FONT_HT; row++)
    {
        for (i = 0; i < len; i++)
        {
            bits = TileGlyph[str[i]][row];
            
            for (col = 0; col < FONT_WD; col++)
            {
                mask = 0x80 >> col;
                
                if (mask & bits)
                {
                    pixel = fg;
                }
                else
                {
                    pixel = bg;
                }
                
                while (PMMODEbits.BUSY)
                    ;

                PMDIN = pixel;
            }
        }
    }
    
    while (PMMODEbits.BUSY)
        ;

    PMADDRbits.CS1 = 0;     // PMCS1 inactive
    PMDIN = 0xffff; // Keep data bus high to work around a hardware problem
}


void ili9486_renderScaledFont(const int x1, const int y1, const int xmag, const int ymag, const iliColr fg, const iliColr bg, const uint8_t * const str)
{
    const int len = strlen(str);
    const int wd = len * FONT_WD * xmag;
    const int ht = FONT_HT * ymag;
    const int x2 = x1 + wd - 1;
    const int y2 = y1 + ht - 1;
    int i, row, col;
    int x, y;
    uint8_t bits, mask;
    iliColr pixel;

    iliCmd4(ILI9486_COL_ADDR, x1 >> 8, x1, x2 >> 8, x2);
    iliCmd4(ILI9486_PAGE_ADDR, y1 >> 8, y1, y2 >> 8, y2);

    PMADDRbits.CS1 = 1; // PMCS1 active

    while (PMMODEbits.BUSY)
        ;

    PMADDRbits.ADDR = 0;
    PMDIN = ILI9486_MEMORY_WR;

    while (PMMODEbits.BUSY)
        ;

    PMADDRbits.ADDR = 1;

    for (row = 0; row < FONT_HT; row++)
    {
        for (y = 0; y < ymag; y++)
        {
            for (i = 0; i < len; i++)
            {
                bits = TileGlyph[str[i]][row];

                for (col = 0; col < FONT_WD; col++)
                {
                    mask = 0x80 >> col;

                    if (mask & bits)
                    {
                        pixel = fg;
                    }
                    else
                    {
                        pixel = bg;
                    }

                    for (x = 0; x < xmag; x++)
                    {
                        while (PMMODEbits.BUSY)
                            ;

                        PMDIN = pixel;
                    }
                }
            }
        }
    }

    while (PMMODEbits.BUSY)
        ;

    PMADDRbits.CS1 = 0; // PMCS1 inactive
    PMDIN = 0xffff; // Keep data bus high to work around a hardware problem
}


/* setLine --- draw a line between any two absolute co-ords */

void setLine(int x1, int y1, int x2, int y2, const iliColr fg)
{
    int d;
    int i1, i2;
    int x, y;
    const int dx = abs(x2 - x1);
    const int dy = abs(y2 - y1);

    if (((y1 > y2) && (dx < dy)) || ((x1 > x2) && (dx > dy)))
    {
        int temp = y1;
        y1 = y2;
        y2 = temp;

        temp = x1;
        x1 = x2;
        x2 = temp;
    }

    if (dy > dx)
    {
        int xinc;
        int yend;
        
        d = (2 * dx) - dy;       /* Slope > 1 */
        i1 = 2 * dx;
        i2 = 2 * (dx - dy);

        if (y1 > y2)
        {
            x = x2;
            y = y2;
            yend = y1;
        }
        else
        {
            x = x1;
            y = y1;
            yend = y2;
        }

        if (x1 > x2)
            xinc = -1;
        else
            xinc = 1;

        setPixel(x, y, fg);

