anachrocomputer/PIC32PMP/ili9486test.X/ili9486test.c
        ili9486_fillRect(0, 0, 319, 0, ILI9486_GREEN);
        
        delayms(500);
        
        LED1 = 1;
        LED2 = 0;
        ili9486_fillRect(0, 0, 319, 0, ILI9486_ORANGE);
        
        before = millis();
        
        for (y = 0; y < 16; y++)
        {
            for (x = 0; x < 16; x++)
            {
                uint8_t ch = (y * 16) + x;
                
                if (ch == 0)
                    ch = ' ';
                
                str[x] = ch;
            }
            
            str[16] = '\0';
            
            ili9486_renderScaledFont((320 - (16 * FONT_WD * XMAG)) / 2, (y * FONT_HT * YMAG) + ((480 - (16 * FONT_HT * YMAG)) / 2), XMAG, YMAG, ILI9486_BLACK, hsvto565(y * 16, MAXPRI, MAXPRI), str);
        }
        
        after = millis();
        printf("\n%dx%d characters took %dms\n", 16, 16, after - before);
        
        delayms(500);
        
        for (i = 0; i < 256; i++)
        {
            const double theta = ((2.0 * M_PI) / 256.0) * (double)i;
            
            xx[i] = (int)((128.0 * cos(theta)) + 0.5) + 160;
            yy[i] = (int)((128.0 * sin(theta)) + 0.5) + 240;
        }
        
        before = millis();
        
        for (i = 0; i < 256; i++)
        {
            setLine(160, 240, xx[i], yy[i], ILI9486_WHITE); // hsvto565(i, MAXPRI, MAXPRI));
        }
        
        after = millis();
        printf("\n%d lines took %dms\n", 256, after - before);
        
        delayms(500);
    }
}
